---
title: GenericMEPFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GenericMEPFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# GenericMEPFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CapsWereAddedWarning { get; }` | `GenericMEPFailures.CapsWereAddedWarning` | FailureDefinitionId |
| `FailureDefinitionId CapWasAddedWarning { get; }` | `GenericMEPFailures.CapWasAddedWarning` | FailureDefinitionId |
| `FailureDefinitionId FailedToPlaceCapWarning { get; }` | `GenericMEPFailures.FailedToPlaceCapWarning` | FailureDefinitionId |
| `FailureDefinitionId FlowConfigMismatch { get; }` | `GenericMEPFailures.FlowConfigMismatch` | FailureDefinitionId |
| `FailureDefinitionId FlowDirectionMismatch { get; }` | `GenericMEPFailures.FlowDirectionMismatch` | FailureDefinitionId |
| `FailureDefinitionId InlineEndoflineMismatch { get; }` | `GenericMEPFailures.InlineEndoflineMismatch` | FailureDefinitionId |
| `FailureDefinitionId MaxWidthAndHeightReached { get; }` | `GenericMEPFailures.MaxWidthAndHeightReached` | FailureDefinitionId |
| `FailureDefinitionId SegmentIsTooShort { get; }` | `GenericMEPFailures.SegmentIsTooShort` | FailureDefinitionId |
| `FailureDefinitionId SizingFailedZeroFlow { get; }` | `GenericMEPFailures.SizingFailedZeroFlow` | FailureDefinitionId |
| `FailureDefinitionId SplitElementDeletionWarning { get; }` | `GenericMEPFailures.SplitElementDeletionWarning` | FailureDefinitionId |
| `FailureDefinitionId ValidatePHSegmentConnWarning { get; }` | `GenericMEPFailures.ValidatePHSegmentConnWarning` | FailureDefinitionId |
| `FailureDefinitionId ValidatePHSegmentLengthWarning { get; }` | `GenericMEPFailures.ValidatePHSegmentLengthWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```